In [1]:
# learning  about arithmetic between  data frame  with  differnet  index value

In [2]:
import numpy as np
import pandas as pd
from pandas import  DataFrame, Series

In [4]:
#Example - Addition of two series

ser1= Series([0,1,2],index=['A','B','C'])
ser1

A    0
B    1
C    2
dtype: int64

In [5]:
ser2 = Series([3,4,5,6],index=['A','B','C','D'])
ser2

A    3
B    4
C    5
D    6
dtype: int64

In [7]:
ser3=ser1+ser2
ser3

A    3.0
B    5.0
C    7.0
D    NaN
dtype: float64

In [8]:
# Example- Addition of two  DataFrame

In [9]:
dframe= DataFrame(np.arange(9).reshape(3,3),columns=list('ABC'),index=['NYC','LA','MIM'])
dframe

     A  B  C
NYC  0  1  2
LA   3  4  5
MIM  6  7  8

In [10]:
dframe2 = DataFrame(np.arange(16).reshape(4,4),columns= list('ABCD'),index=['NYC','LA','MIM','SF'])
dframe2

      A   B   C   D
NYC   0   1   2   3
LA    4   5   6   7
MIM   8   9  10  11
SF   12  13  14  15

In [11]:
dframe+dframe2 #  For missing  Index and  columsn we see values is  filled as  NA

        A     B     C   D
LA    7.0   9.0  11.0 NaN
MIM  14.0  16.0  18.0 NaN
NYC   0.0   2.0   4.0 NaN
SF    NaN   NaN   NaN NaN

In [13]:
# sample - replacing  NA values 
dframe.add(dframe2,fill_value=0) # thi is actual addition of two  Data  Frame

        A     B     C     D
LA    7.0   9.0  11.0   7.0
MIM  14.0  16.0  18.0  11.0
NYC   0.0   2.0   4.0   3.0
SF   12.0  13.0  14.0  15.0

In [14]:
# Example  Operation betweent series and DataFrame

In [ ]:
# creating  Series from Data Frame

In [22]:
ser4= dframe2.iloc[2]
ser4

A     8
B     9
C    10
D    11
Name: MIM, dtype: int32

In [23]:
dframe2

      A   B   C   D
NYC   0   1   2   3
LA    4   5   6   7
MIM   8   9  10  11
SF   12  13  14  15

In [21]:
dframe2-ser4  # sebracting new series with DataFrame

     A  B  C  D
NYC -8 -8 -8 -8
LA  -4 -4 -4 -4
MIM  0  0  0  0
SF   4  4  4  4

In [27]:
dframe2.iloc[3]

A    12
B    13
C    14
D    15
Name: SF, dtype: int32